piconomix/px-fwlib/arch/arm/stm32/tutorials/04_stop_mode/stop_mode.c
/* =============================================================================
     ____    ___    ____    ___    _   _    ___    __  __   ___  __  __ TM
    |  _ \  |_ _|  / ___|  / _ \  | \ | |  / _ \  |  \/  | |_ _| \ \/ /
    | |_) |  | |  | |     | | | | |  \| | | | | | | |\/| |  | |   \  /
    |  __/   | |  | |___  | |_| | | |\  | | |_| | | |  | |  | |   /  \
    |_|     |___|  \____|  \___/  |_| \_|  \___/  |_|  |_| |___| /_/\_\

    Copyright (c) 2019 Pieter Conradie <https://piconomix.com>
 
    Permission is hereby granted, free of charge, to any person obtaining a copy
    of this software and associated documentation files (the "Software"), to
    deal in the Software without restriction, including without limitation the
    rights to use, copy, modify, merge, publish, distribute, sublicense, and/or
    sell copies of the Software, and to permit persons to whom the Software is
    furnished to do so, subject to the following conditions:

    The above copyright notice and this permission notice shall be included in
    all copies or substantial portions of the Software.

    THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
    IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
    FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
    AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
    LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING
    FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS
    IN THE SOFTWARE.

============================================================================= */

/**
 *  @ingroup STM32_TUTORIALS 
 *  @defgroup STM32_TUT04_STOP_MODE 04_stop_mode
 *  
 *  How to wake up on an external interrupt.
 *  
 *  File(s): 
 *  - arch/arm/stm32/tutorials/03_gpio_ext_int/gpio_ext_int.c
 *  
 *  The button GPIO pin (PC9) is configured as an input with pull-up enabled.
 *  The EXTI peripheral is configured to generate an interrupt when a falling
 *  edge (button press event) is detected on line 9. The `EXTI4_15_IRQHandler()`
 *  function is called that handles external interrupts 4 to 15 and it clears
 *  the interrupt flag for external interrupt 9. The interrupt wakes up the
 *  core and the LED will be flashed before it goes back to sleep.
 */

#include "stm32l0xx.h"
#include "stm32l0xx_ll_bus.h"
#include "stm32l0xx_ll_gpio.h"
#include "stm32l0xx_ll_system.h"
#include "stm32l0xx_ll_pwr.h"
#include "stm32l0xx_ll_rcc.h"
#include "stm32l0xx_ll_cortex.h"
#include "stm32l0xx_ll_exti.h"

void EXTI4_15_IRQHandler(void)
{
    // Pending flag set for line 9?
    if(LL_EXTI_IsActiveFlag_0_31(LL_EXTI_LINE_9))
    {
        // Clear pending flag
        LL_EXTI_ClearFlag_0_31(LL_EXTI_LINE_9);
    }    
}

void delay(void)
{
    // Wait ~ 500 ms; default system clock is 2.1 MHz after startup from power reset
    for(uint32_t i = 0x40000; i!=0; i--)
    {
        // Prevent compiler from optimizing and removing empty delay loop
        __asm__ __volatile__("\n\t");
    }
}

int main(void)
{
    // Enable GPIOA, GPIOC, GPIOH, SYSCFG & PWR clocks
    LL_IOP_GRP1_EnableClock(LL_IOP_GRP1_PERIPH_GPIOA);
    LL_IOP_GRP1_EnableClock(LL_IOP_GRP1_PERIPH_GPIOC);
    LL_IOP_GRP1_EnableClock(LL_IOP_GRP1_PERIPH_GPIOH);    
    LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_SYSCFG);
    LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_PWR);

    // Configure LED pin (PH0) as a digital output low
    LL_GPIO_SetPinMode(GPIOH, LL_GPIO_PIN_0, LL_GPIO_MODE_OUTPUT);
    LL_GPIO_ResetOutputPin(GPIOH, LL_GPIO_PIN_0);

    // Configure button pin (PC9) as a digital input with pull-up
    LL_GPIO_SetPinMode(GPIOC, LL_GPIO_PIN_9, LL_GPIO_MODE_INPUT);
    LL_GPIO_SetPinPull(GPIOC, LL_GPIO_PIN_9, LL_GPIO_PULL_UP);

    // Select PC9 for extended interrupt on EXTI9
    LL_SYSCFG_SetEXTISource(LL_SYSCFG_EXTI_PORTC, LL_SYSCFG_EXTI_LINE9);
    // Enable falling edge external interrupt on line 9
    LL_EXTI_EnableIT_0_31(LL_EXTI_LINE_9);
    LL_EXTI_EnableFallingTrig_0_31(LL_EXTI_LINE_9);
    // Enable EXTI4_15 interrupt
    NVIC_EnableIRQ(EXTI4_15_IRQn);

    /*
     *  On reset all pins are analog, except for PA4, PA13 (SWDIO) & PA14 (SWCLK).
     *  The default mode of PA4 is digital input, but it must be configured to 
     *  analog to avoid parasitic consumption. 
     */ 
    LL_GPIO_SetPinMode(GPIOA, LL_GPIO_PIN_4, LL_GPIO_MODE_ANALOG);

    // Repeat forever
    for(;;)
    {
        // Flash LED
        LL_GPIO_SetOutputPin(GPIOH, LL_GPIO_PIN_0);
        delay();
        LL_GPIO_ResetOutputPin(GPIOH, LL_GPIO_PIN_0);
        delay();

        // Enable ultra low power mode by switching off VREFINT during STOP mode
        LL_PWR_EnableUltraLowPower();
        // Enable fast wake up from ultra low power mode
        LL_PWR_EnableFastWakeUp();
        // Clear PDDS bit to enter STOP mode when the CPU enters Deepsleep
        LL_PWR_SetPowerMode(LL_PWR_MODE_STOP);
        // Set LPSDSR bit to switch regulator to low-power mode when the CPU enters Deepsleep
        LL_PWR_SetRegulModeLP(LL_PWR_REGU_LPMODES_LOW_POWER);
        // Clear the WUF flag (after 2 clock cycles)
        LL_PWR_ClearFlag_WU();
        // Set SLEEPDEEP bit of Cortex System Control Register
        LL_LPM_EnableDeepSleep();

        // Put core into STOP mode until an interrupt occurs
        __WFI();
    }
}
